In [13]:
%matplotlib inline
import pandas as pd

In [8]:
titles = pd.read_csv("D:/AI & ML/Lets Upgrade AI-ML/Assignments/Day-16,17/Assingment/Dataset for Pandas Assinment/titles.csv")
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [9]:
titles.tail()

                                      title  year
244909  Black Butterfly in a Colorful World  2018
244910        Hua fei hua wu chun man cheng  1980
244911                 Nippon dabi katsukyu  1970
244912        Under Siege 2: Dark Territory  1995
244913            She Must Be Seeing Things  1987

### How many movies are listed in the titles dataframe?

In [12]:
len(titles)

244914

In [15]:
t = titles['title']
t

0                          Tasveer Mere Sanam
1                                    Only You
2                        El pueblo del terror
3                                     Machine
4                                        MARy
                         ...
244909    Black Butterfly in a Colorful World
244910          Hua fei hua wu chun man cheng
244911                   Nippon dabi katsukyu
244912          Under Siege 2: Dark Territory
244913              She Must Be Seeing Things
Name: title, Length: 244914, dtype: object

### What are the earliest two films listed in the titles dataframe?

In [82]:
t.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [46]:
t = titles
Hamlet = t[ t['title'] == 'Hamlet']
Hamlet
len(Hamlet)

20

In [33]:
titles.set_index('title')

                                     year
title
Tasveer Mere Sanam                   1996
Only You                             1994
El pueblo del terror                 1970
Machine                              2007
MARy                                 2008
...                                   ...
Black Butterfly in a Colorful World  2018
Hua fei hua wu chun man cheng        1980
Nippon dabi katsukyu                 1970
Under Siege 2: Dark Territory        1995
She Must Be Seeing Things            1987

[244914 rows x 1 columns]

### How many movies are titled "North by Northwest"?

In [71]:
t = titles
k=t[ t['title'] == 'North by Northwest']
len(k)

1

### When was the first movie titled "Hamlet" made?

In [99]:
t = titles
Hamlet = t[ t['title'] == 'Hamlet']
Hamlet.sort_values('year')

         title  year
52521   Hamlet  1910
198234  Hamlet  1911
39916   Hamlet  1913
10637   Hamlet  1921
101728  Hamlet  1948
172640  Hamlet  1954
161324  Hamlet  1964
67406   Hamlet  1969
122827  Hamlet  1973
133921  Hamlet  1976
82130   Hamlet  1987
192142  Hamlet  1990
178222  Hamlet  1996
62000   Hamlet  2000
189093  Hamlet  2009
173033  Hamlet  2011
202025  Hamlet  2014
154029  Hamlet  2015
88065   Hamlet  2016
6422    Hamlet  2017

In [98]:
Hamlet.sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [101]:
t = titles
b= t[t['title']=='Treasure Island']
b.sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [39]:
print('No of movies in 1950=',len(titles[titles['year']==1950]))

No of movies in 1950= 1113

### How many movies were made in the year 1960?

In [41]:
print('No of movies in 1960=',len(titles[titles['year']==1960]))

No of movies in 1960= 1549

### How many movies were made from 1950 through 1959?

In [17]:
len(titles[((titles['year']>=1950)& (titles['year']<1960))])

12934

### In what years has a movie titled "Batman" been released?

In [31]:
titles = pd.read_csv("D:/AI & ML/Lets Upgrade AI-ML/Assignments/Day-16,17/Dataset for Pandas Assinment/titles.csv")
t=titles
Batman=t[t['title']=='Batman']
Batman

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [15]:
import pandas as pd
cast_titles = pd.read_csv('D:/AI & ML/Lets Upgrade AI-ML/Assignments/Day-16,17/Dataset for Pandas Assinment/cast.csv')
cast_titles.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [16]:
x = cast_titles[cast_titles.title == 'Inception'] 
y = x[x.n.isnull()] 
len(y)

27

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [35]:
allInceptiondf=cast_titles[(cast_titles['title']=='Inception')]

rolesRecRank=allInceptiondf['n'].notnull().sum()

print('Roles which recieved ranks are :',rolesRecRank)

Roles which recieved ranks are : 51

### But how many roles in the movie "Inception" did receive an "n" value?

In [18]:
allInceptiondf=cast_titles[(cast_titles['title']=='Inception')]

rolesRecRank=allInceptiondf['n'].notnull().sum()

print('Roles which recieved ranks are :',rolesRecRank)

Roles which recieved ranks are : 51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [17]:
allInceptiondf=cast_titles[(cast_titles['title']=='North by Northwest')]

allInceptiondf[allInceptiondf['n'].notna()].sort_values('n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [20]:
Sleuth=cast_titles[(cast_titles['title']=='Sleuth')& (cast_titles['year']==1972)].sort_values('n')

Sleuth

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [21]:
allSleuthdf=cast_titles[(cast_titles['title']=='Sleuth')& (cast_titles['year']==2007)]

print('Cast without Nan: \n',allSleuthdf[allSleuthdf['n'].notna()].sort_values('n'))

print('-----------------------------------------------------------------------------')

print('Cast with Nan: \n',allSleuthdf.sort_values('n'))

Cast without Nan:
           title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0
-----------------------------------------------------------------------------
Cast with Nan:
           title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [40]:
y=cast_titles[(cast_titles['title']=='Hamlet') & (cast_titles['year']==1921)]
print(len(y))

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [41]:
y=cast_titles[(cast_titles['title']=='Hamlet') & (cast_titles['year']==1996)]
print(len(y))

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [56]:
y=cast[(cast['title']=='Hamlet')
print(len(y))

SyntaxError: invalid syntax (<ipython-input-56-2f0635f78126>, line 2)

### How many people have played an "Ophelia"?

In [42]:
y=cast_titles[(cast_titles['title']=='Ophelia')]
print(len(y))

20

### How many people have played a role called "The Dude"?

In [47]:
dude=cast_titles[(cast_titles['title']=='The Dude')]
print(len(dude))

0

### How many people have played a role called "The Stranger"?

In [44]:
y=cast_titles[(cast_titles['title']=='The Stranger')]
print(len(y))

106

### How many roles has Sidney Poitier played throughout his career?

In [53]:
x=cast_titles[(cast_titles.actor=='Sidney Poitier').character
x

SyntaxError: invalid syntax (<ipython-input-53-4bb717dcb287>, line 2)

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [55]:
roles=cast['character'][(cast.n==2) & (cast.year==1940)]
print(len(roles))

810

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

In [22]:
x=cast[(cast.type=='actor') & (cast.year>=1950) & (cast.year<1960)].character
print(len(x))

157738

### How many roles were available for actresses in the 1950s?

In [23]:
y=cast[(cast.type=='actress') & (cast.year>=1950) & (cast.year<1960)].character
print(len(y))

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [24]:
total_num=cast['character'][(cast.n==1) & (cast.year<=1980)]
print(len(total_num))

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [25]:
total_num=cast['character'][(cast.n==2) & (cast.year<=1980)]
print(len(total_num))

61395

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [26]:
total_num=cast['character'][((cast.n!=1 ) | (cast.n!=2)) & (cast.year<=1980)]
print(len(total_num))

1182807